УчетВУправляющихДляГит1/src/Enums/СтатусыКодовМаркировкиСУЗ/СтатусыКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиСУЗ</name>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
  <enumValues>
    <name>Сгенерирован</name>
  </enumValues>
  <enumValues>
    <name>Использован</name>
  </enumValues>
  <enumValues>
    <name>Отбракован</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СпособыВыпускаВОборотСУЗ/СпособыВыпускаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыпускаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыСредствИдентификацииСУЗ/ВидыСредствИдентификацииСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСредствИдентификацииСУЗ</name>
  <enumValues>
    <name>Печатный</name>
  </enumValues>
  <enumValues>
    <name>Клеевой</name>
  </enumValues>
  <enumValues>
    <name>Навесной</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыМаркировкиСУЗ/ВидыМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркировкиСУЗ</name>
  <enumValues>
    <name>НаПотребительскуюУпаковку</name>
  </enumValues>
  <enumValues>
    <name>НаТовар</name>
  </enumValues>
  <enumValues>
    <name>НаТоварныйЯрлык</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ШаблоныКодовМаркировкиСУЗ/ШаблоныКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШаблоныКодовМаркировкиСУЗ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеСредства</name>
  </enumValues>
  <enumValues>
    <name>БлокТабачныхПачек</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПачка</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/CommonModules/ИнтерфейсСУЗСлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ - статус кода маркировки.
//
Функция СтатусКодаМаркировки(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "GENERATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Сгенерирован;
	ИначеЕсли ЗначениеПоиска = "UTILISED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Использован;
	ИначеЕсли ЗначениеПоиска = "DROPPED_OUT" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Отбракован;
	ИначеЕсли ЗначениеПоиска = "PACKED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Упакован;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Перекодирует способ выпуска товаров в для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.СпособыВыпускаВОборотСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.СпособыВыпускаВОборотСУЗ - Результат перекодирования.
//
Функция СпособВыпускаВОборот(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = "PRODUCTION" Тогда
		Результат = Перечисления.СпособыВыпускаВОборотСУЗ.Производство;
	ИначеЕсли ЗначениеПоиска = "IMPORT" Тогда
		Результат = Перечисления.СпособыВыпускаВОборотСУЗ.Импорт;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВыпускаВОборотСУЗ.Производство Тогда
		Результат = "PRODUCTION";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВыпускаВОборотСУЗ.Импорт Тогда
		Результат = "IMPORT";
	Иначе
		ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный способ выпуска в оборот: %1'"),
			ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует вид средства идентификации для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ВидыСредствИдентификацииСУЗ - Значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыСредствИдентификацииСУЗ - Результат перекодирования.
//
Функция ВидСредстваИдентификации(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = "GLUED" Тогда
		Результат = Перечисления.ВидыСредствИдентификацииСУЗ.Клеевой;
	ИначеЕсли ЗначениеПоиска = "PRINTED" Тогда
		Результат = Перечисления.ВидыСредствИдентификацииСУЗ.Печатный;
	ИначеЕсли ЗначениеПоиска = "HINGED" Тогда
		Результат =  Перечисления.ВидыСредствИдентификацииСУЗ.Навесной;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСредствИдентификацииСУЗ.Клеевой Тогда
		Результат =  "GLUED";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСредствИдентификацииСУЗ.Печатный Тогда
		Результат =  "PRINTED";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСредствИдентификацииСУЗ.Навесной Тогда
		Результат =  "HINGED";
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный вид средства идентификации: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует вид маркировки для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ВидыМаркировкиСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыМаркировкиСУЗ - Результат перекодирования.
//
Функция ВидМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = "PRODUCT" Тогда
		Результат = Перечисления.ВидыМаркировкиСУЗ.НаТовар;
	ИначеЕсли ЗначениеПоиска = "PRODUCT_LABEL" Тогда
		Результат = Перечисления.ВидыМаркировкиСУЗ.НаТоварныйЯрлык;
	ИначеЕсли ЗначениеПоиска = "PRODUCT_PACKAGE" Тогда
		Результат =  Перечисления.ВидыМаркировкиСУЗ.НаПотребительскуюУпаковку;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыМаркировкиСУЗ.НаТовар Тогда
		Результат =  "PRODUCT";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыМаркировкиСУЗ.НаПотребительскуюУпаковку Тогда
		Результат =  "PRODUCT_PACKAGE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыМаркировкиСУЗ.НаТоварныйЯрлык Тогда
		Результат =  "PRODUCT_LABEL";
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный вид вид маркировки: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует шаблон кода маркировки для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - Результат перекодирования.
//
Функция ШаблонКодаМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = 1 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь;
	ИначеЕсли ЗначениеПоиска = 2 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛекарственныеСредства;
	ИначеЕсли ЗначениеПоиска = 3 Тогда
		Результат =  Перечисления.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек;
	ИначеЕсли ЗначениеПоиска = 4 Тогда
		Результат =  Перечисления.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь Тогда
		Результат =  1;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛекарственныеСредства Тогда
		Результат =  2;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек Тогда
		Результат =  3;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка Тогда
		Результат =  4;
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный шаблон кода маркировки: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
